api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username = NULL OR email = 'test@mail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first